music_app/music_app/app/controllers/albums_controller.rb

  def new
    @album = Album.new
    @band = Band.find(params[:band_id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

  def create
    @album = Album.new(album_params)
    if @album.save
---
INSERT INTO "albums" ("band_id", "title", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 12], ["title", "Album"], ["year", 2018], ["created_at", "2018-11-16 01:26:14.345268"], ["updated_at", "2018-11-16 01:26:14.345268"]]