music_app/music_app/app/controllers/bands_controller.rb

  def update
    @band = Band.find(params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]