music_app/music_app/app/views/bands/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 12]]
---
  <br><h2>ALBUMS</h2>
  <% @band.albums.each do |album| %>